# coding=utf-8

import chunk


print('**************************************')
#  =================================
# ファイルの作成
#
'''
f = open('test.txt', 'w')
f.write('test')
print('I am print' , file=f)
f.close()
'''
print('**************************************')
#  =================================
# withステートメントでファイルをopenする
#
# f = open('test.txt', 'w')
with open('test.txt', 'w') as f:
    f.write('hogehooge')
'''
'''
print('**************************************')
#  =================================
# ファイルの読み込み
#
s = """\
AAA
BBB
CCC
DDD
"""
with open('test.txt', 'w') as f:
    f.write(s)

# 読み込み
with open('test.txt', 'r') as f:
    # print(f.read())
    while True:
        chunk = 2
        line = f.read(chunk)
        print(line)
        if not line:
            break
    
'''
'''
print('**************************************')
#  =================================
#
#
'''
'''
print('**************************************')
#  =================================
#
#
'''
'''
print('**************************************')
#  =================================
#
#
'''
'''
print('**************************************')
#  =================================
#
#
'''
'''
